[
    {
        "source": "Cover Letter  Product Designer.pdf",
        "text": "[Cover Letter  Product Designer.pdf | Section: General]\nCover Letter  Product Designer Archit Prakash Choudhary Dear Hiring Team at Rank Math, I’m excited to apply for the Product Designer role at Rank Math. The opportunity to design intuitive, scalable experiences for millions of WordPress users strongly resonates with my interest in building meaningful SaaS products that balance usability, performance, and business impact. I’m a Computer Science and Engineering student with a strong foundation in product design, interaction design, and design systems. I’ve worked extensively in Figma on wireframes,"
    },
    {
        "source": "Cover Letter  Product Designer.pdf",
        "text": "[Cover Letter  Product Designer.pdf | Section: General]\nbusiness impact. I’m a Computer Science and Engineering student with a strong foundation in product design, interaction design, and design systems. I’ve worked extensively in Figma on wireframes, high-fidelity prototypes, micro-interactions, and scalable component systems. My projects include designing collaborative platforms like multiple e-commerce and food delivery prototypes where I focused on user flows, feedback states, transitions, and usability improvements. In my academic and independent projects, I’ve practiced user research, persona creation,"
    },
    {
        "source": "Cover Letter  Product Designer.pdf",
        "text": "[Cover Letter  Product Designer.pdf | Section: General]\nprototypes where I focused on user flows, feedback states, transitions, and usability improvements. In my academic and independent projects, I’ve practiced user research, persona creation, usability testing, and iterative design. I enjoy translating complex requirements into simple, elegant interfaces while maintaining accessibility, responsiveness, and visual consistency. I’ve also designed data-heavy interfaces such as Type-Dex, where clarity, hierarchy, and scalability were key considerations  similar to the challenges of designing SaaS dashboards and plugin interfaces."
    },
    {
        "source": "Cover Letter  Product Designer.pdf",
        "text": "[Cover Letter  Product Designer.pdf | Section: General]\nalso designed data-heavy interfaces such as Type-Dex, where clarity, hierarchy, and scalability were key considerations  similar to the challenges of designing SaaS dashboards and plugin interfaces. Beyond design execution, I value collaboration and feedback. As the Design Head of my college’s Photographic Society, I led visual direction, maintained consistency across products, and mentored juniors, which strengthened my communication and leadership skills. My technical background allows me to work closely with developers and understand feasibility, performance tradeoffs, and system constraints."
    },
    {
        "source": "Cover Letter  Product Designer.pdf",
        "text": "[Cover Letter  Product Designer.pdf | Section: General]\nand mentored juniors, which strengthened my communication and leadership skills. My technical background allows me to work closely with developers and understand feasibility, performance tradeoffs, and system constraints. I’m particularly excited about Rank Math’s focus on building high-impact products in the WordPress ecosystem, remote collaboration, and continuous improvement. I’m eager to learn from an experienced team, contribute thoughtfully, and grow into a strong product designer while helping shape user experiences at scale."
    },
    {
        "source": "Cover Letter  Product Designer.pdf",
        "text": "[Cover Letter  Product Designer.pdf | Section: General]\nWordPress ecosystem, remote collaboration, and continuous improvement. I’m eager to learn from an experienced team, contribute thoughtfully, and grow into a strong product designer while helping shape user experiences at scale. Thank you for considering my application. I’d love the opportunity to contribute and learn with the Rank Math team. Warm regards, Archit Prakash Choudhary"
    }
]